using System;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l5t19
{
    /*
     * В классе ChiefCat создайте и реализуйте публичный метод NewOrder(), который:
     *      1) Принимает базовый класс клиента и индикатор наличия специальных потребностей в заказе.
     *      2) Передаёт полученному экземпляру класса значение заказа, основанному на логике предпочтения
     *         каждого из типов клиентов.
     *      3) Каждый из обслуженных клиентов должен иметь соответствующие значения для еды и напитков, 
     *         полученных в результате заказа.
     *      4) В случае если клиент имеет специальные предпочтения в заказе - логика предоставления напитков и еды
     *         в заказе должна поменяться на противоположную.
     * Шаблоны остальных классов изменять нельзя.
     */

    public class ChiefCat
    {
        public static void Main(string[] args)
        {
            
        }

        /* Добавьте свой код ниже */
    }
}
