using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l5t20
{
    /*
     * В отдельных файлах создайте:
     *      1) Публичный абстрактный класс Food.
     *      2) Публичный абстрактный класс SushiMaster, который содержит:
     *         2.1) Публичное свойство Name.
     *         2.2) Конструктор принимающий и устанавливающий значение единственного свойства класса.
     *         2.3) Публичный абстрактный метод Cook(), который ничего не принимает и имеет тип возвращаемого
     *              значения в виде абстрактного класса Food.
     *      3) Для класса Food создайте 3 публичный класса-наследника: Rolls, Sushi, Sashimi.
     * Создайте публичные классы CatMaster и MouseMaster - наследников класса SushiMaster. Реализуйте созданные
     * классы и их абстрактный метод в соответствии со следующей логикой:
     *      1) Каждый повар котик - специалист по производству роллов, однако любой 5-й заказ, возвращаемый 
     *         таким поваром должен являться сашими.
     *      2) Каждый повар мышка - специалист по производству суши, но каждый 2-й заказ, возвращаемый таким
     *         поваром должен являться сашими. 
     */

    public class SushiWorkshop
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
        }
    }     
}
