using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using Newtonsoft.Json;

namespace l9t19
{
    /*
     * Для работы с JSON сериализацией существует множество библиотек, однако на текущий момент
     * одна из них является самой популярной - Newtonsoft.Json
     * Давайте добавим поддержку этой библиотеки в наш проект! Для этого вам необходимо:
     *      1) В обозревателе решений найти текущий проект и нажать на него правой кнопкой.
     *      2) В появившемся контекстном меню нажмите на пункт "Управление пакетами NuGet...".
     *      3) Перейдите во вкладку "Обзор" и в сроке поиска найдите нужный нам пакет.
     *      4) Нажмите кнопку "Установить" и следуйте подсказкам на экране.
     *      5) Добавьте неймспейс Newtonsoft.Json к файлу для класса Program.
     */

    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
        }
    }
}
