using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l4t7
{
    /*
     * Реализуйте атрибут MyClientCountAttribute, который будет осуществлять функции хранения метаинформации для 
     * классов Dog и Cat. Атрибут должен иметь ограничения по возможности применения только для классов.
     * Атрибут должен содержать два публичных свойства CatValue и DogValue, а также конструктор, который
     * принимает тип и целое число - значение показателя для свойства на основе следующей логики:
     *      1) Если значение строки является Cat, то присваивает переданное число свойству CatValue.
     *      2) Если значение строки является Dog, то присваивает переданное число свойству DogValue.
     * Реализуйте классы Cat и Dog таким образом, чтобы показатели возраста всегда были выше или
     * равнялись значениям атрибута. При попытке указать значения, которые не удовлетворяют этому условию -
     * значения должны равняться значению атрибута.
     */

    public class Shop
    {
        public static void Main(string[] args)
        {
            
        }
    }
}
