using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l9t7
{
    /*
     * Для SOAP сериализации требуется некоторое количество дополнительных телодвижений.
     * Основное связано с добавлением сборки, содержащей соответствующий SOAP форматтер.
     * Добавьте в текущий проект ссылку на сборку System.Runtime.Serialization.Formatters.Soap.dll, 
     * для этого:
     *      1) Откройте обозреватель решений в VisualStudio и найдите структуру проекта.
     *      2) Найдите вкладку "Ссылки" (References) и нажмите на неё правой клавишей мыши.
     *      3) В появившемся контекстном меню нажмите пункт "Добавить ссылку..." (Add reference...).
     *      4) В появившемся окне, во вкладке "Сборки" (Assemblies) найдите соответствующую сборку 
     *         (или начните вводить её название в строке поиска).
     *      5) После того как найдёте, поставьте галочку напротив сборки и нажмите на кнопку ОК.
     * Готово! Теперь вы сможете воспользоваться и SOAP форматтером!
     */

    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
        }
    }
}
